app/Controllers/Clientes.php

    public function index(){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new UsuariosModel();
        $usuarios = $model->where('usu_estado', 1)->findAll();
---
SELECT *
FROM `usuarios`
WHERE `usu_estado` = 1

    public function create(){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new UsuariosModel();
        $Usuario = $model->where('usu_estado', 1)->findAll();
---
SELECT *
FROM `usuarios`
WHERE `usu_estado` = 1

                                        "cl_email"=>$datos["cl_email"]
                                );
                                $model = new ClientesModel();
                                $cliente = $model->insert($datos);
---
INSERT INTO `clientes` (`cl_nombre`, `cl_apellido`, `cl_documento`, `td_id`, `cl_telefono`, `cl_email`) VALUES ('Ana', 'Díaz', '123123', '6', '777777777', 'esasdaa@example.com')