app/Models/ClientesModel.php

    public function getClientes(){
        return $this->db->table('clientes cl')
        ->where('cl.cl_estado',1)
        ->join('tipo_documento tido','tido.td_id = cl.td_id')
        ->get()->getResultArray();
---
SELECT *
FROM `clientes` `cl`
JOIN `tipo_documento` `tido` ON `tido`.`td_id` = `cl`.`td_id`
WHERE `cl`.`cl_estado` = 1